package com.example.driverclicker.enums

enum class StatsEnum(
    val title: String,
    val desc: String,
    val plusStat: Int,
    val minusStat: Int,
    val price: Int,
    val action: String //добавить иконки
) {
    Health0("Задремать0", "поспать", 10, -5, 0, "поспал"),
    Health1("Задремать1", "поспать", 10, -5, 0, "поспал"),
    Health2("Задремать2", "поспать", 10, -5, 0, "поспал"),
    Health3("Задремать3", "поспать", 10, -5, 0, "поспал"),
    Health4("Задремать4", "поспать", 10, -5, 0, "поспал"),
    Health5("Задремать5", "поспать", 10, -5, 0, "поспал"),

    Hunger0("Лапша0", "описание6", 10, -5, 0, "Поел"),
    Hunger1("Лапша1", "описание1", 10, -5, 0, "Поел"),
    Hunger2("Лапша2", "описание2", 10, -5, 0, "Поел"),
    Hunger3("Лапша3", "описание3", 10, -5, 0, "Поел"),
    Hunger4("Лапша4", "описание4", 10, -5, 0, "Поел"),
    Hunger5("Лапша5", "описание5", 10, -5, 0, "Поел"),

    Mood0("Настроение0", "Описание1", 10, -5, 0, "Поднял настроение"),
    Mood1("Настроение1", "Описание1", 10, -5, 0, "Поднял настроение"),
    Mood2("Настроение2", "Описание1", 10, -5, 0, "Поднял настроение"),
    Mood3("Настроение3", "Описание1", 10, -5, 0, "Поднял настроение"),
    Mood4("Настроение4", "Описание1", 10, -5, 0, "Поднял настроение"),
    Mood5("Настроение5", "Описание1", 10, -5, 0, "Поднял настроение")
}